app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("address", "city", "country", "created_at", "email", "name", "phone", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "email" = ?, "updated_at" = ? WHERE "students"."id" = 2  [["email", "thapan1@mail.montclair.edu"], ["updated_at", Tue, 13 May 2014 02:28:35 UTC +00:00]]