app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "New Name"], ["email", "new@example.com"], ["updated_at", Fri, 09 May 2014 06:09:03 UTC +00:00]]
---
  def update
    if @user.update_attributes(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy